import { IAuthor } from '../app/core/models/authors-model';

export const poets: IAuthor[] = [
  {
    name: 'Василь Витка',
    liveTime: '	16 мая 1911 - 5 июля 1996 (85 лет)',
    photo: './assets/img/poets-img/Vitka_Vas.jpg',
    biography:
      'советский белорусский поэт, драматург, критик, переводчик, классик белорусской детской литературы',
    timeline: [
      {
        date: '16 мая 1911',
        description:
          'Родился в деревне Евличи Слуцкого уезда Минской губернии в крестьянской семье.',
      },
      {
        date: '1928',
        description:
          'После окончания Слуцкой профтехшколы работал слесарем на Бобруйском деревообрабатывающем комбинате',
      },
      {
        date: '1929—1930',
        description: 'Работал в заводской многотиражке',
      },
      {
        date: '1930—1939',
        description:
          'Работал в редакции газеты «Камуніст», «Ударник», «Чырвоная змена», «Літаратура і мастацтва», «Полымя рэвалюцыі»',
      },
      {
        date: '1942',
        description:
          'Работал в отделе пропаганды и агитации ЦК КПБ редактором массовых изданий для оккупированных районов»',
      },
      {
        date: '1944',
        description:
          'Со дня основания журнала «Беларусь» работал его ответственным секретарём',
      },
      {
        date: '1947',
        description: 'член КПСС',
      },
      {
        date: '1951',
        description:
          'Заместитель редактора белорусской еженедельной литературной газеты Літаратура і мастацтва',
      },
      {
        date: '1951-1957',
        description:
          'Главный редактор белорусской еженедельной литературной газеты Літаратура і мастацтва',
      },
      {
        date: '1957—1974',
        description: 'главный редактор детского журнала «Вясёлка»',
      },
      {
        date: '1974—1987',
        description:
          'член сценарно-редакционной коллегии киностудии «Беларусьфильм»',
      },
    ],
    works: [
      {
        date: '1943',
        work: 'Закалка',
      },
      {
        date: '1946',
        work: 'Полдень',
      },
      {
        date: '1953',
        work: 'Верность',
      },
      {
        date: '1958',
        work: 'Роза и штык',
      },
      {
        date: '1961',
        work: 'Поверка',
      },
      {
        date: '1968',
        work: 'Стихи',
      },
      {
        date: '1971',
        work: 'Белорусская колыбельная',
      },
      {
        date: '1972',
        work: 'Проводы лета',
      },
      {
        date: '1977',
        work: 'Вершины света',
      },
      {
        date: '1981',
        work: 'Слутчина',
      },
      {
        date: '1988',
        work: 'Третьи петухи',
      },
    ],
    galery: [
      {
        photo: './assets/img/poets-img/vv.jpg',
      },
      {
        photo: './assets/img/poets-img/vasilv.jpg',
      },
      {
        photo: './assets/img/poets-img/vasilvitka.jpg',
      },
    ],
    youtube: '',
    activity: [
      {
        lat: '53.893009',
        lon: '27.567444',
      },
    ],
  },
  {
    name: 'Анато́лий Степа́нович Велю́гин',
    liveTime: '27 декабря 1923 - 24 октября 1994 (70 лет)',
    photo: './assets/img/poets-img/Vialugin.jpg',
    biography:
      'белорусский советский поэт, прозаик и переводчик, киносценарист. Лауреат Литературной премии имени Янки Купалы (1964)',
    timeline: [
      {
        date: '1939-1940',
        description:
          'Будучи студентом литературного факультета Минского педагогического института, работал в редакции газеты «Звезда»',
      },
      {
        date: '1941',
        description: 'Учился в Свердловским педагогическом институте',
      },
      {
        date: '1942',
        description:
          'Был призван в РККА, учился в Лугинской авиашколе, участвовал в боях на Сталинградском фронте',
      },
      {
        date: '1943',
        description: 'Был ранен, долгое время находился на лечении',
      },
      {
        date: '1945-1946',
        description: 'Работал в газете «Літаратура і мастацтва»',
      },
      {
        date: '1948',
        description:
          'Окончил заочно Минский педагогический институт имени Максима Горького',
      },
      {
        date: '1946-1984',
        description:
          'С небольшими перерывами работал редактором отдела поэзии журнала «Полымя»',
      },
    ],
    works: [
      {
        date: '1947',
        work: 'Салют в Минске',
      },
      {
        date: '1949',
        work: 'Негорельская арка',
      },
      {
        date: '1952',
        work: 'На подступах',
      },
      {
        date: '1958',
        work: 'На зори занимает',
      },
      {
        date: '1960',
        work: 'Настежь',
      },
      {
        date: '1964',
        work: 'Адрес любви',
      },
      {
        date: '1969',
        work: 'Стихи и баллады',
      },
    ],
    galery: [
      {
        photo: './assets/img/poets-img/v.jpg',
      },
      {
        photo: './assets/img/poets-img/av.jpg',
      },
      {
        photo: './assets/img/poets-img/avv.jpg',
      },
    ],
    youtube: 'https://www.youtube.com/watch?v=0pZZW0LocrA',
    activity: [
      {
        lat: '53.893009',
        lon: '27.567444',
      },
    ],
  },
];
