import { IAuthor } from '../../app/core/models/authors-model';

export const poet: IAuthor = {
  id: "Timothy_Vasilyevich",
  name: 'Цімафей Васільевіч Крысько',
  liveTime: '16 мая 1911 - 5 ліпеня 1996 (85 гадоў)',
  photo: './assets/img/poets-img/Vitka_Vas.jpg',
  biography:
    'савецкі беларускі паэт, драматург, крытык, перакладчык, класік беларускай дзіцячай літаратуры',
  timeline: [
    {
      date: '16 мая 1911',
      description:
        "Нарадзіўся ў вёсцы Еўлічы Слуцкага павета Менскай губерні ў сялянскай сям'і.",
    },
    {
      date: '1928',
      description:
        'Пасля заканчэння Слуцкай прафтэхшколы працаваў слесарам на Бабруйскім дрэваапрацоўчым камбінаце',
    },
    {
      date: '1929—1930',
      description: 'працаваў у завадской шматтыражцы',
    },
    {
      date: '1930—1939',
      description:
        'Працаваў у рэдакцыі газеты «Камуніст», «Ударнік», «Чырвоная змена», «Літаратура і мастацтва», «Полымя рэвалюцыі»',
    },
    {
      date: '1942',
      description:
        'Працаваў у аддзеле прапаганды і агітацыі ЦК КПБ рэдактарам масавых выданняў для акупаваных раёнаў"',
    },
    {
      date: '1944',
      description:
        'З дня заснавання часопіса «Беларусь» працаваў яго адказным сакратаром',
    },
    {
      date: '1947',
      description: 'член КПСС',
    },
    {
      date: '1951',
      description:
        'Намеснік рэдактара беларускай штотыднёвай Літаратурнай газеты Літаратура і мастацтва',
    },
    {
      date: '1951-1957',
      description:
        'Галоўны рэдактар беларускай штотыднёвай Літаратурнай газеты Літаратура і мастацтва',
    },
    {
      date: '1957—1974',
      description: 'галоўны рэдактар дзіцячага часопіса «Вясёлка»',
    },
    {
      date: '1974—1987',
      description:
        'член сцэнарна-рэдакцыйнай калегіі кінастудыі «Беларусьфільм»',
    },
  ],
  works: [
    {
      date: '1943',
      work: 'загартоўка',
    },
    {
      date: '1946',
      work: 'Апоўдні',
    },
    {
      date: '1953',
      work: 'Вернасць',
    },
    {
      date: '1958',
      work: 'Ружа і штык',
    },
    {
      date: '1961',
      work: 'Паверка',
    },
    {
      date: '1968',
      work: 'Вершы',
    },
    {
      date: '1971',
      work: 'Беларуская калыханка',
    },
    {
      date: '1972',
      work: 'Праводзіны лета',
    },
    {
      date: '1977',
      work: 'Вяршыні святла',
    },
    {
      date: '1981',
      work: 'Слутчына',
    },
    {
      date: '1988',
      work: 'трэція пеўні',
    },
  ],
  galery: [
    {
      photo: './assets/img/poets-img/img0_orig.jpg',
    },
    {
      photo: './assets/img/poets-img/vv.jpg',
    },
    {
      photo: 'assets/img/poets-img/vasilv.jpg',
    },
    {
      photo: 'assets/img/poets-img/vasilvitka.jpg',
    },
  ],
  youtube: '',
  activity: [
    {
      lat: '52.98',
      lon: '27.35',
    },
  ],
};
