import { IAuthor } from '../../app/core/models/authors-model';

export const poets: IAuthor[] = [
  {
    id: "Timothy_Vasilyevich",
    name: 'Василь Витка',
    liveTime: '	16 мая 1911 - 5 июля 1996 (85 лет)',
    photo: './assets/img/poets-img/Vitka_Vas.jpg',
    biography:
      'советский белорусский поэт, драматург, критик, переводчик, классик белорусской детской литературы',
    timeline: [
      {
        date: '16 мая 1911',
        description:
          'Родился в деревне Евличи Слуцкого уезда Минской губернии в крестьянской семье.',
      },
      {
        date: '1928',
        description:
          'После окончания Слуцкой профтехшколы работал слесарем на Бобруйском деревообрабатывающем комбинате',
      },
      {
        date: '1929—1930',
        description: 'Работал в заводской многотиражке',
      },
      {
        date: '1930—1939',
        description:
          'Работал в редакции газеты «Камуніст», «Ударник», «Чырвоная змена», «Літаратура і мастацтва», «Полымя рэвалюцыі»',
      },
      {
        date: '1942',
        description:
          'Работал в отделе пропаганды и агитации ЦК КПБ редактором массовых изданий для оккупированных районов»',
      },
      {
        date: '1944',
        description:
          'Со дня основания журнала «Беларусь» работал его ответственным секретарём',
      },
      {
        date: '1947',
        description: 'член КПСС',
      },
      {
        date: '1951',
        description:
          'Заместитель редактора белорусской еженедельной литературной газеты Літаратура і мастацтва',
      },
      {
        date: '1951-1957',
        description:
          'Главный редактор белорусской еженедельной литературной газеты Літаратура і мастацтва',
      },
      {
        date: '1957—1974',
        description: 'главный редактор детского журнала «Вясёлка»',
      },
      {
        date: '1974—1987',
        description:
          'член сценарно-редакционной коллегии киностудии «Беларусьфильм»',
      },
    ],
    works: [
      {
        date: '1943',
        work: 'Закалка',
      },
      {
        date: '1946',
        work: 'Полдень',
      },
      {
        date: '1953',
        work: 'Верность',
      },
      {
        date: '1958',
        work: 'Роза и штык',
      },
      {
        date: '1961',
        work: 'Поверка',
      },
      {
        date: '1968',
        work: 'Стихи',
      },
      {
        date: '1971',
        work: 'Белорусская колыбельная',
      },
      {
        date: '1972',
        work: 'Проводы лета',
      },
      {
        date: '1977',
        work: 'Вершины света',
      },
      {
        date: '1981',
        work: 'Слутчина',
      },
      {
        date: '1988',
        work: 'Третьи петухи',
      },
    ],
    galery: [
      {
        photo: './assets/img/poets-img/img1_orig.jpg',
      },
      {
        photo: './assets/img/poets-img/vv.jpg',
      },
      {
        photo: './assets/img/poets-img/vasilv.jpg',
      },
      {
        photo: './assets/img/poets-img/vasilvitka.jpg',
      },
    ],
    youtube: '',
    activity: [
      {
        lat: '53.893009',
        lon: '27.567444',
      },
    ],
  },
  {
    id: "Anatoly_Stepanovich",
    name: 'Анато́лий Степа́нович Велю́гин',
    liveTime: '27 декабря 1923 - 24 октября 1994 (70 лет)',
    photo: './assets/img/poets-img/Vialugin.jpg',
    biography:
      'белорусский советский поэт, прозаик и переводчик, киносценарист. Лауреат Литературной премии имени Янки Купалы (1964)',
    timeline: [
      {
        date: '1939-1940',
        description:
          'Будучи студентом литературного факультета Минского педагогического института, работал в редакции газеты «Звезда»',
      },
      {
        date: '1941',
        description: 'Учился в Свердловским педагогическом институте',
      },
      {
        date: '1942',
        description:
          'Был призван в РККА, учился в Лугинской авиашколе, участвовал в боях на Сталинградском фронте',
      },
      {
        date: '1943',
        description: 'Был ранен, долгое время находился на лечении',
      },
      {
        date: '1945-1946',
        description: 'Работал в газете «Літаратура і мастацтва»',
      },
      {
        date: '1948',
        description:
          'Окончил заочно Минский педагогический институт имени Максима Горького',
      },
      {
        date: '1946-1984',
        description:
          'С небольшими перерывами работал редактором отдела поэзии журнала «Полымя»',
      },
    ],
    works: [
      {
        date: '1947',
        work: 'Салют в Минске',
      },
      {
        date: '1949',
        work: 'Негорельская арка',
      },
      {
        date: '1952',
        work: 'На подступах',
      },
      {
        date: '1958',
        work: 'На зори занимает',
      },
      {
        date: '1960',
        work: 'Настежь',
      },
      {
        date: '1964',
        work: 'Адрес любви',
      },
      {
        date: '1969',
        work: 'Стихи и баллады',
      },
    ],
    galery: [
      {
        photo: './assets/img/poets-img/img2_orig.jpg',
      },
      {
        photo: './assets/img/poets-img/v.jpg',
      },
      {
        photo: './assets/img/poets-img/av.jpg',
      },
      {
        photo: './assets/img/poets-img/avv.jpg',
      },
    ],
    youtube: 'https://www.youtube.com/watch?v=0pZZW0LocrA',
    activity: [
      {
        lat: '53.893009',
        lon: '27.567444',
      },
    ],
  },
  {
    id: "Marina_Mikhailovna",
    name: 'Мари́на Миха́йловна Веселу́ха',
    liveTime: '15 июля 1987, Миоры, Витебская область - xxxx',
    photo: './assets/img/poets-img/VesjaluchaMaryna.jpg',
    biography:
      'белорусский литературный критик, литературовед, поэт, переводчик',
    timeline: [
      {
        date: '2004',
        description:
          'Окончила Мижевицкую среднюю школу (Гродненская область, Слонимский район) с золотой медалью',
      },
      {
        date: '2011',
        description: 'Магистр филологических наук в области литературоведения',
      },
      {
        date: '2010-2016',
        description:
          'Редактор, завотделом «Книжный мир» газеты «Літаратура і мастацтва»',
      },
      {
        date: '2016',
        description:
          'Редактор отдела культуры в центральной белорусской газете «Звязда»',
      },
    ],
    works: [
      {
        date: '2008',
        work:
          'Дебютировала стихами в журнале «Дзеяслоў». Выступает с материалами о теории современного литературного процесса, пишет критические статьи, рецензии на книги, занимается литературно-художественным творчеством',
      },
      {
        date: '2013',
        work:
          'одна из победителей конкурса молодых критиков имени Адама Бабареко.',
      },
      {
        date: '2015',
        work:
          'диплом лауреата в номинации «Лучший обозреватель» по итогам ХІ национального конкурса печатных изданий «Залатая Ліцера»',
      },
    ],
    galery: [
      {
        photo: './assets/img/poets-img/VesjaluchaMaryna.jpg',
      },
      {
        photo: './assets/img/poets-img/VesjaluchaMaryna.jpg',
      },
      {
        photo: './assets/img/poets-img/VesjaluchaMaryna.jpg',
      },
    ],
    youtube: 'https://www.youtube.com/watch?v=0pZZW0LocrA',
    activity: [
      {
        lat: '53.893009',
        lon: '27.567444',
      },
    ],
  },
  {
    id: "Vladimir_Vyacheslavovich",
    name: 'Ада́м Гло́бус',
    liveTime: '29 сентября 1958 (61 год) - xxxx',
    photo: './assets/img/poets-img/Adam_Globus.jpg',
    biography: 'советский и белорусский писатель, поэт, художник, издатель',
    timeline: [
      {
        date: '1959',
        description: 'живёт в Минске',
      },
      {
        date: '1977',
        description:
          'Окончил педагогическое отделение Минского художественного училища им. А. К. Глебова',
      },
      {
        date: '1983',
        description:
          'Окончил художественное отделение Белорусского театрально-художественного института',
      },
      {
        date: '1987',
        description:
          'Работал чертёжником, художником-реставратором, художником-оформителем, редактором журнала «Родник»',
      },
    ],
    works: [
      {
        date: '1981',
        work: 'еженедельник «Літаратура і мастацтва», журнал «Маладосць»',
      },
      {
        date: '1991',
        work: 'Оборотни',
      },
      {
        date: '1993',
        work: 'Demonokameron',
      },
      {
        date: '2007',
        work: 'Лирика BY',
      },
    ],
    galery: [
      {
        photo: './assets/img/poets-img/a.jpg',
      },
      {
        photo: './assets/img/poets-img/g.jpg',
      },
      {
        photo: './assets/img/poets-img/ag.jpg',
      },
    ],
    youtube: 'https://www.youtube.com/watch?v=2eVcgft9gpY',
    activity: [
      {
        lat: '53.893009',
        lon: '27.567444',
      },
    ],
  },
  {
    id: "Yuri_Igorevich",
    name: 'Юрий Игоревич Гуменюк',
    liveTime: '24 сентября 1969 — 19 января 2013',
    photo: './assets/img/poets-img/Juryj_Humianiuk_w_Warszawie_4.jpg',
    biography: 'белорусский поэт, прозаик, журналист',
    timeline: [
      {
        date: '1994',
        description:
          'Окончил Гродненский государственный университет имени Янки Купалы, отделение полонистики, учился в аспирантуре при нём',
      },
      {
        date: '1991-1994',
        description:
          'На гродненском областном радио готовил литературно-художественный радиожурнал «Контекст»',
      },
      {
        date: '1992, 1995—2001',
        description: 'Работал журналистом в газете «Погоня»',
      },
      {
        date: '2004',
        description: 'Работал журналистом в газете «День»',
      },
      {
        date: '1994-2000',
        description:
          'работал заведующим литературной частью Гродненского театра кукол',
      },
      {
        date: '2002',
        description: 'публицист белостокского месячника «Czasopis»',
      },
    ],
    works: [
      {
        date: '1992',
        work: 'Формат тела',
      },
      {
        date: '1994',
        work: 'Лицо Тутанхамона',
      },
      {
        date: '1999',
        work: 'Ритуал',
      },
      {
        date: '2003',
        work: 'Улица тигровых орхидей. Стихи 1987—2002',
      },
    ],
    galery: [
      {
        photo: './assets/img/poets-img/gum.jpg',
      },
      {
        photo: './assets/img/poets-img/y.jpeg',
      },
      {
        photo: './assets/img/poets-img/Juryj_Humianiuk_w_Warszawie_4.jpg',
      },
    ],
    youtube: '',
    activity: [
      {
        lat: '53.893009',
        lon: '27.567444',
      },
    ],
  },
  {
    id: "Girsh_Solomonovich",
    name: 'Гирш Соломо́нович (Григо́рий Льво́вич) Ре́лес',
    liveTime: '23 апреля 1913 - 18 сентября 2004 (91 год)',
    photo: './assets/img/poets-img/Reles_G.jpg',
    biography:
      'еврейский писатель, писал на идише, белорусском и русском языках.',
    timeline: [
      {
        date: '1913',
        description:
          'Родился в семье меламеда (учителя в хедере) и поэта на иврите Лейба Релеса в Чашниках',
      },
      {
        date: '1930',
        description:
          'Опубликовал первое стихотворение на идише в газете «Юнгер Арбэтэр»',
      },
      {
        date: '1936',
        description: 'Член еврейской секции Союза писателей БССР',
      },
      {
        date: '1937',
        description: 'исключён из еврейской секции Союза писателей БССР',
      },
    ],
    works: [
      {
        date: '1939',
        work: '«Онхейб» («Начало»)',
      },
      {
        date: '1960',
        work: 'Записки моего коллеги',
      },
      {
        date: '1963',
        work: 'Друзья и знакомые',
      },
      {
        date: '1966',
        work: 'За тесными партами',
      },
      {
        date: '1972',
        work: 'В родном уголке',
      },
      {
        date: '1976',
        work: 'Через трудный порог',
      },
      {
        date: '1979',
        work: 'Под каждой крышей',
      },
      {
        date: '2004',
        work: 'Еврейские советские писатели Белоруссии',
      },
    ],
    galery: [
      {
        photo: './assets/img/poets-img/r.jpg',
      },
      {
        photo: './assets/img/poets-img/re.jpg',
      },
      {
        photo: './assets/img/poets-img/rel.jpg',
      },
    ],
    youtube: '',
    activity: [
      {
        lat: '53.893009',
        lon: '27.567444',
      },
    ],
  },
  {
    id: "Alexander_Stepanovich",
    name: 'Александр Степанович Поскрёбышев',
    liveTime: '13 апреля 1935 - 6 августа 2007 (72 года)',
    photo: './assets/img/poets-img/Poskrebyshev_A_S.jpg',
    biography: 'белорусский прозаик, поэт, детский писатель.',
    timeline: [
      {
        date: '1935',
        description:
          'Родился в России, в деревне Антипинцы Кировского края, сейчас Унинский район Кировской области, в детском возрасте переехал в Белоруссию',
      },
      {
        date: '1951',
        description:
          'В 16 лет лишился зрения, однако смог стать медицинским работником. Жил в к.п. Нарочь, работал массажистом в санатории «Нарочь»',
      },
      {
        date: '1969',
        description:
          'Первый рассказ «Воробьи» был напечатан в журнале «Вясёлка». Первая книга «Страшны гусак»',
      },
      {
        date: '2007',
        description: 'Умер в 2007 году. Похоронен на кладбище в д. Нарочь.',
      },
    ],
    works: [
      {
        date: '1969',
        work: 'Страшны гусак',
      },
      {
        date: '1973',
        work: 'Гронка рабіны',
      },
      {
        date: '1976',
        work: 'Жывы пярсцёнак',
      },
      {
        date: '1980',
        work: 'Міколка-паляўнічы',
      },
      {
        date: '1987',
        work: 'Міколкава камандзіроўка',
      },
    ],
    galery: [
      {
        photo: './assets/img/poets-img/Poskrebyshev_A_S.jpg',
      },
      {
        photo: './assets/img/poets-img/Poskrebyshev_A_S.jpg',
      },
      {
        photo: './assets/img/poets-img/Poskrebyshev_A_S.jpg',
      },
    ],
    youtube: '',
    activity: [
      {
        lat: '53.893009',
        lon: '27.567444',
      },
    ],
  },
];
